{
  "main": {
    "name": "Ivan Lei",
    "occupation": "Software Engineer",
    "description": "I have previous experience in developing full stack web applications and technologies I'm familiar with are PostgreSQL, Heroku, Express, and Ruby on Rails",
    "image": "profile.png",
    "bio": "I'm a 19 year old developer and I love to create things. When I'm not thinking about how I can top Elon Musk, I enjoy going to the gym, socializing with friends, and listening to music! ",
    "contactmessage": "For any questions or inquiries please contact me below.",
    "email": "ilei0893@gmail.com",
    "phone": "718-313-8873",
    "address": {
      "street": "5 Piave Ave",
      "city": "Staten Island",
      "state": "NY",
      "zip": "10305"
    },
    "website": "https://www.ivanlei.com",
    "resumedownload": "https://ivanlei.com",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/ivan-lei/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/ilei0893",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "",
    "education": [
      {
        "school": "CUNY College of Staten Island",
        "degree": "Computer Science BS",
        "graduated": "Expected Winter 2021",
        "description": "Current junior majoring in Computer Science. Relevant courses include: C++ Programming, Data Structures, Object-Oriented Software Design, Algorithms, and Discrete Structures."
      }
    ],
    "work": [
      {
        "company": "Occupier",
        "title": "Software Engineer Intern",
        "years": "June 2020 - August 2020",
        "description": "Contributed directly to web application software to develop new features for a Beta V1 launch. Wrote End-to-end and Unit tests using Cypress and Jest respectively, increasing testing suite by 20%. Collaborated with senior engineers on developing new features based off of Clubhouse.io to track user stories. Followed Test Driven Development practices to decrease time spent tracking and fixing bugs which allowed company to save $100,000."
      }
    ],
    "skills": [
      {
        "name": "Git/Github",
        "level": "70%"
      },
      {
        "name": "Ruby",
        "level": "70%"
      },
      {
        "name": "Javascript",
        "level": "75%"
      },
      {
        "name": "ReactJs",
        "level": "70%"
      },
      {
        "name": "CSS",
        "level": "60%"
      },
      {
        "name": "HTML5",
        "level": "60%"
      },
      {
        "name": "C++",
        "level": "65%"
      },
      {
        "name": "Java",
        "level": "70%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Covid-19 Tracker",
        "category": "Accurate up-to-date statistics on the pandemic",
        "image": "covid.PNG",
        "url": "https://ilei0893.github.io/Covid19Tracker/"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Ivan was a joy to work with on the Occupier engineering team for the duration of his summer internship. Undeterred by the plethora of new tools and technologies he was introduced to in our tech stack, he showed a passion and enthusiasm for learning and mastering them. I was impressed at how quickly he picked up complex concepts and began contributing to our codebase within his first week on the job. Over the course of the summer, Ivan helped us add more end to end test coverage to the app, and built an error page for the site which directs customers to our customer support portal. Some of Ivan's key strengths are his communication skills and his willingness to ask for help. This is something that is tough for a lot of people, especially software engineers, and Ivan really excels at this. We would be happy to host him again as an intern!",
        "user": "Elaina Polson"
      }
    ]
  }
}
